"""

ORM(Object-relation-mapping) -
    это технология программирования,
    которая позволяет преобразовывать
    несовместимые типы моделей в ООП,
    в частности между хранилищем данных и объектами программирования

ORM - используется для упрощения процесса сохранения объектов
    в реляционную базу данных и их извлечения.

Ключевая особенность ORM - отображение, которое используется
    для привязки объекта к его данным в БД.

ORM автоматизирует трансфер данных, хранящихся в таблицах вашей БД
    в объекты, которые используются в программном коде.

"""