"""

ИНДЕКСЫ в PSQL - специальные объекты БД предназначенные 
в основном для ускорения доступа к данным
-------------------------------------------------------------------------------------

Создание индекса:
    CREATE INDEX name_of_index ON name_of_table (name_of_column);
-------------------------------------------------------------------------------------

Удаление индекса:
    DROP INDEX name_of_index;
-------------------------------------------------------------------------------------

Типы индексов:
    1. B-дерево
    2. Хеш
    3. GiST
    4. SP-GiST
    5. GIN
    6. BRIN
-------------------------------------------------------------------------------------

Перенос БД:
    psql db_name < input_file.sql  (import)
    pg_dump db_name > output_file.sql  (export)
    
"""